# Zone Cooling Air Temperature Property

Source: https://www.revitapidocs.com/2026/dee8a5e9-2804-2a14-abf7-443af84aca34.htm

---

| Zone Cooling Air Temperature Property |
| --- |

**Note: This API is now obsolete.**

Get or set the Cooling Air Temperature of the Zone.
**Namespace:** Autodesk.Revit.DB.Mechanical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
[ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone and SystemZoneElementType objects instead.")]
public double CoolingAirTemperature { get; set; }
```

```
<ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone and SystemZoneElementType objects instead.")>
Public Property CoolingAirTemperature As Double
	Get
	Set
```

```
public:
[ObsoleteAttribute(L"This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone and SystemZoneElementType objects instead.")]
property double CoolingAirTemperature {
	double get ();
	void set (double value);
}
```

```
[<ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone and SystemZoneElementType objects instead.")>]
member CoolingAirTemperature : float with get, set
```

#### Property Value

Double Remarks This property is used to get or set the Cooling Air Temperature of the Zone. See Also

#### Reference

Zone Class Autodesk.Revit.DB.Mechanical Namespace